app/Controllers/Dashboard.php

SELECT *
FROM `tb_member`
WHERE `id_group` = '2'
---
    public function index()
    {
        $selectedGroup = $this->request->getGet('id_group') ?? session('id_group');

        $memberModel = new Member_model();
        $id_group = session()->get('id_group');
        $memberEmails = $memberModel->getProgressByMemberGroup($id_group);
        $members = $memberModel->where('id_group', $selectedGroup)->findAll();