app/Controllers/Login.php

    public function process()
    {
        $users = new Member_model();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $dataUser = $users->where([
            'email_member' => $email,
        ])->first();
---
SELECT *
FROM `tb_member`
WHERE `email_member` = 'Aminah'
 LIMIT 1