app/Controllers/Progress.php

SELECT *
FROM `tb_kirim_email`
WHERE `tb_kirim_email`.`id_kirim_email` = '39'
SELECT *
FROM `tb_member`
---
    public function edit($id_kirim_email)
    {
        $kirimEmailModel = new Kirim_email_model();
        // $data['kirim_email'] = $kirimEmailModel->find($id_kirim_email);
        $kirim_email = $kirimEmailModel->find($id_kirim_email);

        $memberModel = new \App\Models\Member_model();
        $nama_members = $memberModel->findAll();