app/Models/Kirim_email_model.php

    public function getTotalNegara($id_group)
    {
        $query = $this->db->table('tb_kirim_email')
            ->select('tb_kirim_email.negara_perusahaan, COUNT(tb_kirim_email.negara_perusahaan) AS total_negara', false)
            ->join('tb_member', 'tb_member.id_member = tb_kirim_email.id_member')
            ->where('tb_member.id_group', $id_group)
            ->groupBy('tb_kirim_email.negara_perusahaan')
            ->get();
---
SELECT tb_kirim_email.negara_perusahaan, COUNT(tb_kirim_email.negara_perusahaan) AS total_negara
FROM `tb_kirim_email`
JOIN `tb_member` ON `tb_member`.`id_member` = `tb_kirim_email`.`id_member`
WHERE `tb_member`.`id_group` = '2'
GROUP BY `tb_kirim_email`.`negara_perusahaan`