app/Models/Member_model.php

SELECT *
FROM `tb_member`
JOIN `tb_kirim_email` ON `tb_member`.`id_member` = `tb_kirim_email`.`id_member`
WHERE `tb_member`.`id_member` = '1'
ORDER BY `tb_kirim_email`.`id_kirim_email` DESC
---
    public function getProgressByMemberId($id_member)
    {
        // Query untuk mengambil data progress berdasarkan id_member
        $query = $this->db->table('tb_member')
            ->join('tb_kirim_email', 'tb_member.id_member = tb_kirim_email.id_member')
            ->where('tb_member.id_member', $id_member)
            ->orderBy('tb_kirim_email.id_kirim_email', 'DESC')
            ->get();

SELECT tb_member.id_member, tb_member.nama_member, COUNT(tb_kirim_email.id_member) AS kirim_emails_count
FROM `tb_member`
JOIN `tb_kirim_email` ON `tb_member`.`id_member` = `tb_kirim_email`.`id_member`
WHERE `tb_member`.`id_group` = '2'
GROUP BY `tb_member`.`id_member`, `tb_member`.`nama_member`
---
    public function getProgressByMemberGroup($id_group)
    {
        // Query untuk mengambil data progress berdasarkan id_member
        $query = $this->db->table('tb_member')
            ->join('tb_kirim_email', 'tb_member.id_member = tb_kirim_email.id_member')
            ->where('tb_member.id_group', $id_group)
            ->select('tb_member.id_member, tb_member.nama_member, COUNT(tb_kirim_email.id_member) AS kirim_emails_count', false)
            ->groupBy('tb_member.id_member, tb_member.nama_member')
            ->get();